---
kind: type
id: T:Autodesk.Revit.UI.Selection.PickBoxStyle
source: html/b66a5404-4dba-abc0-f16d-0477e5c8a974.htm
---
# Autodesk.Revit.UI.Selection.PickBoxStyle

The enum that controls the style of the pick box.

## Syntax (C#)
```csharp
public enum PickBoxStyle
```